zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT600/MIMXRT633S/iar/startup_MIMXRT633S.s
; -------------------------------------------------------------------------
;  @file:    startup_MIMXRT633S.s
;  @purpose: CMSIS Cortex-M33 Core Device Startup File
;            MIMXRT633S
;  @version: 3.0
;  @date:    2024-10-29
;  @build:   b250520
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2025 NXP
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)
        SECTION RO:CODE:NOROOT(2)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

;;The vector table is not needed for initialization.
__iar_init$$done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     SecureFault_Handler                           ;Secure Fault Handler
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
        DCD     0x180000 ;Image length
#else
        DCD     sfe(RO) - __vector_table ;Image length
#endif
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     __vector_table                                ;Image load address
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     WDT0_IRQHandler                               ;Windowed watchdog timer 0 (CM33 watchdog)
        DCD     DMA0_IRQHandler                               ;DMA controller 0 (secure or CM33 DMA)
        DCD     GPIO_INTA_IRQHandler                          ;GPIO interrupt A
        DCD     GPIO_INTB_IRQHandler                          ;GPIO interrupt B
        DCD     PIN_INT0_IRQHandler                           ;Pin interrupt 0 or pattern match engine slice 0 int
        DCD     PIN_INT1_IRQHandler                           ;Pin interrupt 1 or pattern match engine slice 1 int
        DCD     PIN_INT2_IRQHandler                           ;Pin interrupt 2 or pattern match engine slice 2 int
        DCD     PIN_INT3_IRQHandler                           ;Pin interrupt 3 or pattern match engine slice 3 int
        DCD     UTICK0_IRQHandler                             ;Micro-tick Timer
        DCD     MRT0_IRQHandler                               ;Multi-Rate Timer
        DCD     CTIMER0_IRQHandler                            ;Standard counter/timer CTIMER0
        DCD     CTIMER1_IRQHandler                            ;Standard counter/timer CTIMER1
        DCD     SCT0_IRQHandler                               ;SCTimer/PWM
        DCD     CTIMER3_IRQHandler                            ;Standard counter/timer CTIMER3
        DCD     FLEXCOMM0_IRQHandler                          ;Flexcomm Interface 0 (USART, SPI, I2C, I2S)
        DCD     FLEXCOMM1_IRQHandler                          ;Flexcomm Interface 1 (USART, SPI, I2C, I2S)
        DCD     FLEXCOMM2_IRQHandler                          ;Flexcomm Interface 2 (USART, SPI, I2C, I2S)
        DCD     FLEXCOMM3_IRQHandler                          ;Flexcomm Interface 3 (USART, SPI, I2C, I2S)
        DCD     FLEXCOMM4_IRQHandler                          ;Flexcomm Interface 4 (USART, SPI, I2C, I2S)
        DCD     FLEXCOMM5_IRQHandler                          ;Flexcomm Interface 5 (USART, SPI, I2C, I2S)
        DCD     FLEXCOMM14_IRQHandler                         ;Flexcomm Interface 14 (SPI only)
        DCD     FLEXCOMM15_IRQHandler                         ;Flexcomm Interface 15 (I2C only)
        DCD     ADC0_IRQHandler                               ;ADC0
        DCD     Reserved39_IRQHandler                         ;Reserved interrupt
        DCD     ACMP_IRQHandler                               ;Analog comparator
        DCD     DMIC0_IRQHandler                              ;Digital microphone and DMIC subsystem
        DCD     Reserved42_IRQHandler                         ;Reserved interrupt
        DCD     HYPERVISOR_IRQHandler                         ;Hypervisor
        DCD     SECUREVIOLATION_IRQHandler                    ;Secure violation
        DCD     HWVAD0_IRQHandler                             ;Hardware Voice Activity Detector
        DCD     ESPI_IRQHandler                               ;eSPI interface
        DCD     RNG_IRQHandler                                ;Random number Generator
        DCD     RTC_IRQHandler                                ;RTC alarm and wake-up
        DCD     Reserved49_IRQHandler                         ;Reserved interrupt
        DCD     MU_A_IRQHandler                               ;Messaging Unit port A for CM33
        DCD     PIN_INT4_IRQHandler                           ;Pin interrupt 4 or pattern match engine slice 4 int
        DCD     PIN_INT5_IRQHandler                           ;Pin interrupt 5 or pattern match engine slice 5 int
        DCD     PIN_INT6_IRQHandler                           ;Pin interrupt 6 or pattern match engine slice 6 int
        DCD     PIN_INT7_IRQHandler                           ;Pin interrupt 7 or pattern match engine slice 7 int
        DCD     CTIMER2_IRQHandler                            ;Standard counter/timer CTIMER2
        DCD     CTIMER4_IRQHandler                            ;Standard counter/timer CTIMER4
        DCD     OS_EVENT_IRQHandler                           ;OS event timer
        DCD     FLEXSPI_IRQHandler                            ;FLEXSPI interface
        DCD     FLEXCOMM6_IRQHandler                          ;Flexcomm Interface 6 (USART, SPI, I2C, I2S)
        DCD     FLEXCOMM7_IRQHandler                          ;Flexcomm Interface 7 (USART, SPI, I2C, I2S)
        DCD     USDHC0_IRQHandler                             ;USDHC0 (Enhanced SDHC) interrupt request
        DCD     USDHC1_IRQHandler                             ;USDHC1 (Enhanced SDHC) interrupt request
        DCD     SGPIO_INTA_IRQHandler                         ;Secure GPIO interrupt A
        DCD     SGPIO_INTB_IRQHandler                         ;Secure GPIO interrupt B
        DCD     I3C0_IRQHandler                               ;I3C interface 0
        DCD     USB_IRQHandler                                ;High-speed USB device/host
        DCD     USB_WAKEUP_IRQHandler                         ;USB Activity Wake-up Interrupt
        DCD     WDT1_IRQHandler                               ;Windowed watchdog timer 1 (HiFi 4 watchdog)
        DCD     USBPHY_DCD_IRQHandler                         ;USBPHY DCD
        DCD     DMA1_IRQHandler                               ;DMA controller 1 (non-secure or HiFi 4 DMA)
        DCD     PUF_IRQHandler                                ;Physical Unclonable Function
        DCD     POWERQUAD_IRQHandler                          ;PowerQuad math coprocessor
        DCD     CASPER_IRQHandler                             ;Casper cryptographic coprocessor
        DCD     PMC_PMIC_IRQHandler                           ;Power management IC
        DCD     HASHCRYPT_IRQHandler                          ;Hash-AES unit
__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
        CPSID   I               ; Mask interrupts
        LDR     R0, =0xE000ED08
        LDR     R1, =__vector_table
        STR     R1, [R0]
        LDR     R2, [R1]
        MSR     MSP, R2
        LDR     R0, =sfb(CSTACK)
        MSR     MSPLIM, R0
        CPSIE   I               ; Unmask interrupts
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

